Revit 2027 API
Pipe.Create(Document, ElementId, ElementId, Connector, XYZ) Method
 Creates a new pipe that connects to the connector.
Namespace: Autodesk.Revit.DB.Plumbing
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static Pipe Create(
	Document document,
	ElementId pipeTypeId,
	ElementId levelId,
	Connector startConnector,
	XYZ endPoint
)
Public Shared Function Create (
	document As Document,
	pipeTypeId As ElementId,
	levelId As ElementId,
	startConnector As Connector,
	endPoint As XYZ
) As Pipe
public:
static Pipe^ Create(
	Document^ document,
	ElementId^ pipeTypeId,
	ElementId^ levelId,
	Connector^ startConnector,
	XYZ^ endPoint
)
static member Create :
        document : Document *
        pipeTypeId : ElementId *
        levelId : ElementId *
        startConnector : Connector *
        endPoint : XYZ -> Pipe
Parameters
document Document
 The document.
pipeTypeId ElementId
 The ElementId of the new pipe type.
levelId ElementId
 The level id for the new pipe.
startConnector Connector
 The first connector where the new pipe starts.
endPoint XYZ
 The second point of the new pipe.
Return Value
Pipe
 The pipe.
Exceptions
Exception | Condition
ArgumentException |  The pipe type pipeTypeId is not valid pipe type. -or- The ElementId levelId is not a Level. -or- The connector domain is not Domain.Piping. -or- The points of startConnector and endPoint are too close: for MEPCurve, the minimum length is 1/10 inch.
ArgumentNullException |  A non-optional argument was null
InvalidOperationException |  Thrown when the new pipe fails to connect with the connector.
Remarks
 The new pipe will have the same diameter and system type as the specified connector. The creation will also connect the new pipe to the component who owns the specified connector. If necessary, additional fitting(s) are included to make a valid connection. If the new pipe can not be connected to the next component (e.g., mismatched direction, no valid fitting, and etc), the new pipe will still be created at the specified connector position, and an InvalidOperationException is thrown.
See Also
Reference
Pipe Class
Create Overload
Autodesk.Revit.DB.Plumbing Namespace